Repository: danilodequeiroz/flutter-gymapp-trail
Catalog: lib/l10n/app_*.arb
Languages: pt

# flutterDemoHomePageTitle
source: Flutter Demo Home Page
pt: Flutter Demo Page Principal

# incrementClicked
source: click increment!!
pt: clique incrementou!

# navigationItemHelpTitle
source: Help
pt: Ajuda

# incrementClickTitleFeedBack
source: You have pushed the button this many times:
pt: Tu pressionastes o botão esta quantidade de tempo:

# incrementFabTooltip
source: Increment
pt: Incrementar

source: High Pronade Pulldown - Training A
pt: Puxada Alta Pronada - Treino A

source: High Pronade Pulldown
pt: Puxada Alta Pronada

source: Hold the bar and pull.
pt: Segura a barra e puxa.

source: Training A
pt: Treino A

# putPictureKeyLabel
source: Insert photo...
pt: Enviar foto...

# deletePictureKeyLabel
source: Remove photo...
pt: Remover foto...

# howToDoKeyLabel
source: How do I do?
pt: Como fazer?

# howAmIFeelingKeyLabel
source: How am I feeling?
pt: Como estou me sentindo?

# formPasswordKeyLabel
source: Password
pt: Senha

# formConfirmPasswordKeyLabel
source: Confirm password
pt: Confirmar senha

# formNameKeyLabel
source: Name
pt: Nome

# formSignupKeyLabel
source: Sign-up
pt: Cadastrar

# formDontHaveAccountKeyLabel
source: Don't you have an account, sign-up clicking here.
pt: Se não tem conta, cadastre-se clicando aqui.

# formAlreadyHaveAccountKeyLabel
source: Already have an account, click here to logg-in.
pt: Se já tem uma conta, logue-se clicando aqui.

# emailCannotBeEmpty
source: The Email cannot be empty.
pt: O e-mail não pode ser vazio.

# emailIsTooShort
source: The Email is too short
pt: O e-mail é muito curto

# emailIsInvalid
source: The email is invalid
pt: O e-mail não é valido

# passwordIsShort
source: The password is too short (min. 9 characters).
pt: A senha é curta (min. 9 carácteres).

# passwordMustContainUppercaseCharacter
source: The Password must contain uppercase character(s).
pt: A senha deve conter carácter(es) maiúsculo(s).

# passwordMustContainLowercaseCharacter
source: The Password must contain lowercase character(s).
pt: A senha deve conter carácter(es) minúsculo(s).

# passwordMustContainNumber
source: The Password must contain number(s)
pt: A senha deve conter número(os)

# passwordMustContainSpecialCharacter
source: The Password must contains special character(s)
pt: A senha deve conter carácter(es) especial(ais)

# nameCannotBeEmpty
source: The name cannot be empty.
pt: O nome não pode ser vazio.

# nameIsTooShort
source: The name is too short (min. 5 characters).
pt: O nome é muito curto (min. 5 carácteres).
